import mysql.connector
# Підключення до бази даних
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="mypassword",
  database="mydatabase"
)

mycursor = mydb.cursor()

# Заповнення таблиць даними
# Додавання 5 орендарів
tenants_data = [
    ('ТОВ Магазин', 'Олег А.О ', '123456789'),
    ('ТОВ Аптека', 'Валентина С.С', '987654321'),
    ('Крамничка', 'Сергій С.А', '456123789'),
    ('Аптечні засоби', 'Наталія К.Є', '321654987'),
    ('Рукавичка', 'Едуард С.О', '789456123')
]
mycursor.executemany("INSERT INTO Tenants (Name, Manager, Phone) VALUES (%s, %s, %s)", tenants_data)

# Додавання 11 приміщень
room_data = [
    (100, 10, 2, 'Так', 'Звичайне'),
    (150, 15, 3, 'Ні', 'Поліпшене'),
    (200, 20, 4, 'Так', 'Поліпшене'),
    (120, 12, 1, 'Так', 'Євро'),
    (180, 18, 2, 'Так', 'Поліпшене'),
    (130, 13, 3, 'Так', 'Звичайне'),
    (210, 21, 4, 'Ні', 'Євро'),
    (110, 11, 1, 'Так', 'Євро'),
    (160, 16, 2, 'Ні', 'Євро'),
    (140, 14, 3, 'Ні', 'Звичайне'),
    (190, 19, 4, 'Ні', 'Звичайне')
]
mycursor.executemany("INSERT INTO Room (Square, Cost, Floor, IndoorTelephone, Formalization) VALUES (%s, %s, %s, %s, %s)", room_data)

# Додавання 11 договорів оренди
rent_data = [
    ('2023-01-01', 365, 'Склад', 1, 1),
    ('2023-02-01', 365, 'Офіс', 2, 2),
    ('2023-03-01', 365, 'Склад', 3, 3),
    ('2023-04-01', 365, 'Офіс', 4, 4),
    ('2023-05-01', 365, 'Склад', 5, 5),
    ('2023-06-01', 365, 'Склад', 1, 6),
    ('2023-07-01', 365, 'Склад', 2, 7),
    ('2023-08-01', 365, 'Офіс', 3, 8),
    ('2023-09-01', 365, 'Офіс', 4, 9),
    ('2023-10-01', 365, 'Офіс', 5, 10),
    ('2023-11-01', 365, 'Офіс', 1, 11)
]
mycursor.executemany("INSERT INTO Rent (StartDate, ContractTerm, Purpose, ID_rentatol, ID_Room) VALUES (%s, %s, %s, %s, %s)", rent_data)

# Збереження змін
mydb.commit()

# Закриття підключення